{
  "date": "2025-11-28",
  "title": "call with mindsie 1",
  "description": "Soren Frederikse and Bill Karpovich\n\nSoren Frederikse and Bill Karpovich\nTranscript\n\nhttps://otter.ai/u/wWb8oBXX7DiRELZ72wqhxR_blS4?view=summary\n\nSoren Frederiksen and Bill Karpovich discussed the potential collaboration between Soren's process mining company, Mindsey, and Bill's company. Soren highlighted Mindsey's tech stack, which includes a no-code platform for process mining and task mining, and their experience with on-premise solutions. Bill expressed interest in leveraging Mindsey's technology for their next-generation task and process mining platform, targeting the US market. They agreed to schedule a technical call to explore further, focusing on Mindsey's capabilities and potential integration with Bill's company's offerings.\n\nAction Items\n[ ] @Soren Frederiksen - Schedule a technical call between Soren, Bill, and Bill's partner.\n[ ] @Soren Frederiksen - Provide a platform overview and demo of Mindzie's capabilities, especially in the healthcare industry.\nOutline\nSoren's Background and Current Location\nSoren Frederiksen mentions he is in a lake house north of Toronto, about two hours away from the city.\nBill Karpovich shares his familiarity with Toronto, mentioning his son's hockey trips and his previous role at IBM.\nSoren explains his move to the lake house after his kids moved out and the convenience of remote work during COVID-19.\nBill inquires about Soren's ability to connect and the context of their conversation.\nBill's Company and Market Opportunity\nBill explains his company's focus on task mining and process mining, seeing a significant opportunity in the next generation of these technologies.\nHe highlights the importance of understanding processes securely and linking them to AI-based solutions.\nBill mentions the company's history of building successful products and their current early product development stage.\nHe seeks a strong, innovative technology leader to help bring their product to market and execute their strategy.\nSoren's Company and Process Mining Experience\nSoren provides an overview of his company, Mindsey, which started five years ago and has a full tech stack.\nHe mentions his partner, James Henderson, and their experience in the process mining space, including their platform's ability to go on-premise.\nSoren discusses the challenges of selling process mining in the US compared to Europe, where it has been more established.\nHe explains their strategy of focusing on outcomes rather than the process maps themselves.\nChallenges and Market Dynamics\nSoren shares his concerns about the US market's slow adoption of process mining and the challenges of selling to US companies.\nHe mentions the impact of companies like Celonis and Appromote being bought by larger entities, which has affected the market dynamics.\nSoren discusses the importance of having a data strategy and the challenges of dealing with siloed databases in large companies.\nBill and Soren discuss the potential for task mining and its limitations, particularly in terms of privacy and installation time.\nSoren's Approach to Process Mining\nSoren explains his preference for process mining over task mining due to its lower cost and fewer privacy issues.\nHe shares his experience with task mining in a few cases but generally finds it less practical.\nSoren discusses the importance of understanding the customer's needs and the challenges of implementing task mining in large organizations.\nBill and Soren discuss the potential for task mining in specific scenarios and the overall market dynamics.\nSoren's Company's Tech Stack and Market Position\nSoren describes their tech stack as modern and capable of handling both process and task mining.\nHe explains their approach of connecting directly to source systems rather than using a centralized data warehouse.\nSoren highlights the flexibility of their platform, which can be hosted on-premise or in the cloud.\nBill expresses interest in learning more about Soren's company and their approach to process mining.\nPotential Collaboration and Next Steps\nBill inquires about the possibility of a partnership or OEM agreement with Soren's company.\nSoren expresses openness to consulting and sharing their knowledge, but emphasizes his commitment to his current partner.\nThey discuss the potential for a technical call to explore collaboration further.\nBill and Soren agree to schedule a follow-up call to discuss their platform and potential collaboration in more detail.\nSoren's Experience with Healthcare and On-Premise Solutions\nSoren shares his experience with healthcare clients, including Motorola and Ottawa Hospital, and the challenges of implementing process mining in this sector.\nHe discusses the importance of on-premise solutions for healthcare organizations and the limitations of cloud-only solutions.\nSoren mentions their ability to host their platform on various cloud providers and their experience with hosting in Saudi Arabia.\nBill and Soren discuss the potential for collaboration in the healthcare sector and the challenges of working with large, complex organizations.\nFinal Remarks and Scheduling\nBill and Soren agree to schedule a technical call for Monday or Tuesday to discuss Soren's platform in more detail.\nSoren offers to include his partner, James, in the call if needed.\nThey discuss the format of the call and the focus on learning about Soren's platform rather than a sales pitch.\nBill and Soren conclude the call, expressing mutual interest in exploring potential collaboration opportunities.",
  "takeaways": "",
  "url": "",
  "transcriptionText": "Soren Frederiksen  0:00  \nNorth. So except for the snow, I'm good.\n\nBill Karpovich  0:04  \nWe got a little down North Carolina at the family beach house, and we've got a little cold down here too today. So are you up in Toronto? I presume,\n\nSoren Frederiksen  0:15  \nyeah, yeah, Toronto, just north of Toronto, actually, in the lake house.\n\nBill Karpovich  0:20  \nSo okay, what's my son is hockey player. And so I have spent a decent amount of time in the different burbs of Toronto on hockey trips the and actually, my ran IBM's cloud for a while, and we had a lot of folks up in in Toronto. So a lot of good visits and lot of good fun, lot of traffic. But other than that, it's good place.\n\nSoren Frederiksen  0:52  \nHence why I'm sitting north of Toronto. So gotten old enough now to get out of town.\n\nBill Karpovich  0:59  \nUnderstood how far from downtown Are you?\n\nSoren Frederiksen  1:02  \nNo way. We're two hours north of Toronto, actually, in a cottage area where we kind of moved up in the later years when the kids had moved out of the house. So Okay, and with covid, everybody is remote anyway, currently.\n\nBill Karpovich  1:15  \nSo yeah, yeah,\n\nSoren Frederiksen  1:19  \nwe work from anywhere.\n\nBill Karpovich  1:22  \nI Great. Well, it sounds like Ross able to connect with you or reach out to you. What? What context do you have on on the conversation?\n\nSoren Frederiksen  1:33  \nWell, just a little bit that you were looking for something to build, process, task, mining, which I didn't quite understand, but Ross did say that he wasn't really sure what it was, but I was interested, because we do, I mean, we do process mining, right? So, so he just said he you wanted something in the process space, but I think a little bit more context would be good bill of what it is you're looking for.\n\nBill Karpovich  1:56  \nYeah, yeah, you bet. Well, so the tour of it is we have, I can tell a little more about the company, the platform and all that kind of stuff. But just at the highest level we are, we see just a huge opportunity for a next generation of of task mining and and process mining. They work together at some level. And you know, particularly in this, just as it was a big phenomenon as a precursor to rpa, you know, with this agentic transformation, it's, you know, a much bigger opportunity, as we see it right now, and we see the customers we're working with deploying vertical agents and Helping them in various ways that that there's just really a frozenness in the market, and so much of it is just an inability to really get into understanding the processes really well. Do it in a way that's not frightening. Do it in a way that's that's secure, easier to adopt than I think the truth been and and, of course, link it to a value chain of AI based solutions along with the other stuff you have to do. It's not just the technology, as you know, drive a transformation on the project process and so anyway, so we are building a new stack to go after this opportunity and have some ways we're going to focus the technology and the market and the business model that we think can create some real velocity. And we have a history of building successful products and spinning them out of this parent company that we have that happens to be in the market, working with customers, right? So it's a an easy, easier place to launch from. We've got early, early product now. They're working with customers on and we're looking for a really strong, innovative technology leader to really help bring this to to to the market an interesting way and help, you know, be a key partner in figuring out the strategy and how to go execute on this. And naturally, we wanted to look at folks who've been in the space and have some experience, but also can bridge and think about, hey, what's what's next? That's the quick summary. All right,\n\nSoren Frederiksen  4:26  \nmaybe, maybe I should also just give you my background a little bit. So it's a couple of things. I mean, I got into the age where become a lot more honest with people, because I don't want to work with somebody if it's no fit bill is, like, that's kind of the upfront thing, right? Where? So I let me explain a little bit of where the situation my in and what I'm not really looking for a job right now, right? That's the one thing. But because we started five years ago, we started a process mining company. If you looked at my LinkedIn profile, you'll see we have a company called mindsey, yeah, and so, but, but where that is at, to be honest, we've done it for about five years, and we started it right right before. I don't know if you there was two big companies that got bought up, one by Microsoft and one by celonis for 120 million. And we started right before that, and that seemed to be the ending of purchasing in the process mining space, until now, recently with appremore, got bought by Salesforce, which you probably know. So we have a company now. We're not big, but we have a full tech stack where I built all of it. So I've been a product developer for many, many years. I still develop software, but also sit kind of in between on the business side and meet with customers. So we have a full working platform bill, and one of the things we actually do is we also owe yemet. So the conversation with you like could take many different ways, right? So I thought, let's have the talk. But I have a partner that I worked with for a long, long time. His name is James Henderson. He used, he sold a vigilan, which is, which at the time, was 1400 people. They sold it out to more. Motorola for like, like, a lot of money. So when after that, we started mind z because we saw that process, mining was super interesting. It wasn't really in the US, and celonis was somewhat the only game in town that were good, and some smaller players also. So we thought about consulting and using other tools, but decided to build our own. So that's what we spent the last five years. Now we have a fully fledged platform that can do a whole bunch of different things, and we Omn it, and we go on premise, which a lot of our competitors don't. A lot of our competitors are cloud only, but we deal with healthcare a lot, and we have to go on premise, and that's our that's our biggest differentiator, right? We did not come out of academia like apromote. We are both business people, so we've only built process mining for what's relevant for business, not because it's technically interesting. So, so that's a high level. That's where we're at. I've been in neural networks and AI since the 90s. I built my first neural network. I'm an electrical engineer, which I saw you were as well. I've never used my like electrical engineering degree. I've always been in software.\n\nBill Karpovich  7:09  \nYeah, Likewise, likewise, yeah.\n\nSoren Frederiksen  7:11  \nBut I came to Toronto and we competed against Hinton. When Hinton stuff was bad in AI, we were actually competitor to him early on. Guy I worked for was a mad professor, so his business didn't take off. But so I've been doing AI for a long time, and then I did face rec for casinos for a long time, and built casino systems with facial recognition. And now process mining. And there are so many things and why it's also interesting to have the talk. There's so many interesting parts of process mining. And because you mentioned task mining and the RPAS, it is really weird that RPAS came before process mining in North America. People are optimizing things that should never have been optimized in the first place, but they don't really know, right? They go out and Bill they have a crappy process, and then they speed up the crappy process, instead of figuring out, how should we do it differently? It's backwards, yeah. But also, Bill, we've almost stopped selling to the US, because the problem is, if I call a customer and they say, What is process mining? We're now six to 12 months sales cycle, sure, right? So we get all of our business like Turkey is a huge place for us right now, for instance. And we get in Australia and around the world. So North America, we haven't really been able to tap into the market any like\n\nBill Karpovich  8:26  \nis that, Soren, do you think somebody that your, your peers and other folks in the market have also adopted? I've certainly noticed that that it's a western world is a lot stronger.\n\nSoren Frederiksen  8:39  \nYeah, a lot of it comes from salons, right? There's good and bad salon is there's a great company. They've done some great stuff, but they've also over promised, right? They go in and promise the moon to people, and then they charge them a million and a half dollars, and the results haven't been there, right? So we come after so many of these people that got burned with salonis, but so a whole bunch of ideas of why? Because I think US companies are run very differently than European companies. US companies are very typically top down, right? A boss tells you what to do, and it spreads down, whereas in Europe there's more autonomy for people make their own decisions. So they're more open to looking at technologies from the bottom, because process mining is a technical thing. It's hard to sell to CEOs, right? If you go say, and we don't say process mining at all anymore, we actually say process intelligence, and we only sell the outcomes, not the maps and all that stuff, right? Because nobody cares, right? We do like they care if we sell to the analyst, but if you sell to the higher ups, then it doesn't matter. So I just think it's been in Europe longer, right? I mean, been Bill van das came from there, and all of this stuff came out of Holland. So it's kind of spread more there, and it's still so few people using it North America, yeah, we, we have one customer, two customers in Canada and two in the US, but that's all the rest around the world we\n\nBill Karpovich  10:01  \nand then, and then the I see your website says 1000 customers. Is that? Is that the right way to think about it, or is that a different metric? How many in Europe and rest of world, then do you have? If you only have a handful in the US in North America,\n\nSoren Frederiksen  10:15  \nif we don't have 1000 I don't know that 1000 people tried it, but not paying bill, to be honest, we're not big, right? And that's one of our problems right now, is we got to figure out what to do, because we're also a small company. I like, we, we use AI for everything internally, and we've had in we've actually had aI integrated with our product. All of our development is done with AI, like, I do all of it with AI agents, and Claude code is one of our things. So yeah,\n\nBill Karpovich  10:41  \nso we're, we're 100% club code shop too. So we're, we're kind of with you.\n\nSoren Frederiksen  10:46  \nSo so it's unbelievable how much you can do. And actually I'm finding also a lot of things from the people we hired to do some of our front end stuff I'm now cleaning up because they weren't as good as maybe they should have been. So I'm actually finding you can do a whole lot of things with a lot less. And we're doing some things with process mining, where you upload your data and you get a report sent to you, that's kind of where we want to go, right? Because there's nobody has time anymore. And problem is also we go into companies so big problem us, also they don't have a data strategy. I find a lot in the US, like some companies do, right? Don't get me wrong. Some are really, really good, and they do. But a lot of companies we go into, like Motorola, for instance, they have stuff in siloed databases, and you got to collect all that together to do process mining on right? You got to get access to it. So, so there's a there's a couple of problems with process mining, and what Ross mentioned, at least, you wanted to use it for something specific and not be a process mining vendor. Is that correct? You want to more go out and solve problems for industries, right? Yeah. And I think it's much better, because it doesn't really matter what runs under the hood. Process mining is amazing to do that. But you're not selling process mining, you're selling a better delivery process, right? Or faster? Absolutely.\n\nBill Karpovich  11:59  \nYeah, yeah. And I think that's the part of the I think just the difference different way of land in the market to appeal to the US market. I think for sure, yeah, it's interesting. What when you guys say you're small, it looks like CrunchBase said, you know, kind of couple million bucks raised. And I don't know if that's accurate or not, but you guys, you know, in the, you know, kind of low single digit millions of revenue kind of thing is that the way I should think about Yes,\n\nSoren Frederiksen  12:29  \nbut so we don't really disclose our revenue right now, because we're private, so we don't, but we're small. We're running this with two and a half people,\n\nBill Karpovich  12:38  \noh, two and a half people, right?\n\nSoren Frederiksen  12:41  \nWhich we don't disclose, but, like, that's it's really the founder and I, because we kind of wanted to regroup, it wasn't going as fast as we wanted. So we say, let's cut down our expenses, because if we raise right now, we're not going to get the funding we want out of this, or we're going to give up. We're too old to give up control. That's our bigger thing right now, and I've been in it too often where, like, I've sold private businesses and a venture capital comes in, and then the whole thing, I feel often, just get lost in a bigger shuffle, right? So, so that's where we're at. We don't want to so we're trying to figure out, and we're trying to build it back up to get more customers and figure out what niche we're in. So because the tech stack is 99% done, and so that's not it's really okay.\n\nBill Karpovich  13:25  \nSo you feel like you've got modern tech stack at this point, and that's across the desktop and the task mining side, as well as the process mining.\n\nSoren Frederiksen  13:33  \nWe have some task mining. I'm not a big fan of task mining. Have you used it in anywhere? Because the problem with task mining is you get into privacy. It takes a long time to install. So we've actually found often that you only need task mining for the steps that are not in your ERP, right? So if you have an ERP system like SAP, most of the things are captured in SAP, you can pull out the data and figure out what happens in your process. If you then have two steps that are not tracked in SAP, and you want time in between there, then you'd go to use task mining. We do it, but we haven't really done it for more than two customers. And it's I find the cost of doing task mining versus process mining is so big and the problems are much bigger, so I would have to find a really good scenario to do task mining instead of just doing process mining?\n\nBill Karpovich  14:23  \nThat's interesting, and you think that is that a generally held principle, again, against our experience, from what you've seen, it seems like task mining is a bit of a surgence here, with new people, new desktop recorders of all different types, right, who were providing different elements of value, and you know, some other folks who are venture backed, who are kind of going after it is, you think it's a fool's errand based on your experience, or\n\nSoren Frederiksen  14:53  \nI just, I haven't seen any customer that's used it. I know, I know their company that sell it. We do it. We do it as a thing to tick the box in the marketing tool, right when we go in, because people wanted it. We never really, I'm really not a big same reason. I'm not a big proponent of RPAS, because you're taking a crappy system and you're kind of gluing things on top and automating it. But in I understand that, because in some cases, you have no choice, right? You can't rip out your ERP and put something else in. So that I understand. But task mining, I haven't seen a good scenario for it yet where you don't get into trouble with privacy. So if I want to record your screen, what you do during the day? And I come and say, Billy, we're going to record you today. You don't behave normally anymore. First of all, right, you shape up. And if you very few companies allow you to record all the time, yeah. So, so, I don't know, I find, we just found the task manual was fraught with a lot of problems that we didn't really want to go into the size we are, and you need to know the customer really well, right? So, so we've, we've had three customers ask for it, to use it, but barely, and they ended up using process mining instead for\n\nBill Karpovich  16:06  \nwho's doing well in the space. Do you think\n\nSoren Frederiksen  16:10  \napromoch claimed they were right? Celonis is doing well. They're just they're not doing as well as they wanted. And they try to seem to want to go public a couple of times. I'm curious to hear what you know. Because if you're in the Salesforce space, and you know that Salesforce bought app for more, right, aren't they going to be bundled? But there's still, you think, room for doing Salesforce process mining, even, know what's expensive?\n\nBill Karpovich  16:34  \nYeah, for sure. So you know you've got the first of all, it's going to take them a year to figure this out. And we've competed inside of Salesforce. You always, you kind of have this weird thing where you compete with them, but you also can work with them. And so I think there's certain little bit of a time we know some of the people over there and just are confident. They're not. We just, we see a play that to be proven, that can just go at much higher velocity. As Have you seen, as you know, per your experience, it's been, it's been slow going. So we see those guys as kind of the more of the traditional play, as opposed to, hey, let's go take a new and fresh approach. And the other problem here is that this is a an area where I think customers don't want to go to their big platform vendor and say, Tell me how to go improve this, because they know the answer is going to be buy more my stuff. And we've had and we're in working with Salesforce folks as we've been working on this, on this product, and showing them, like, Yeah, this is really good, and I'm so glad that I'll bring you into accounts, because they won't trust me if I'm telling them that this is the problem, right? And this is how to solve it. And so I think Salesforce will be, you know, they'll They're obviously a potent player, so you never underestimate, you know, big company who's done, done well, but, but we know them well, and we know that the way they're going to land with this will believe plenty of opportunities. And we're using Salesforce also has really a bowling pin for us, right? There's 20,000 customers on service cloud, and I can tell you, you know, 10, 10,000 of them are ripe for, you know, gosh, how would, how could I just, you know, really hone a service process. And so there's plenty of market here. But you know, the reality is, the business processes span more than Salesforce, as you know. And you know, we do see some of the the opportunity is, is to capture those nooks and crannies, whether it's Hey, I'm in slack over here doing this, or I'm in email over here doing that, and, and how do you go and and take those workflows and and address some of those gaps that you're you're not going to see just looking at, you know what? You go with the server. So net, net is, we certainly are following it, but it hasn't just dissuaded this, and we certainly see it also as a point of validation. You know, if they're, they're investing here, they're they're realizing, and we're selling with Salesforce every day. And we can tell you from experience and talking to clients, they have no idea. To sell a genetic transformation, agentic transformation is process transformation, and to do process transformation to your early point, you got to understand your processes.\n\nSoren Frederiksen  19:41  \nYeah, that's the first step.\n\nBill Karpovich  19:43  \nYeah, and so, so they're, they're acknowledging it. We think there's plenty room. We'll keep an eye out on them. And that's how we\n\nSoren Frederiksen  19:53  \nit's, I mean that for more was interesting. Also met the guys quite a lot, and conferences and stuff, and they're really smart, but they're very, very research based, right? They're very out of like academia. The tools were very nerdy, and\n\nBill Karpovich  20:09  \nthat's been my observation in this space, being pretty new to it, right? You know, it's awesome to talk to guys like you. Is it's everybody's coming at it from this incredibly academic space, even the US, companies and and so and the business, there's no velocity, the business models. And we just think there's, there's a lot of great thinking is done, a lot of smart people and but there is a, you know, not unlike what you said, you guys have this commercial mindset and, and we've been successful bidding companies here, you know, and that have certainly served rest of world, but are North American centric, we just see a real opportunity that's just not being filled, that works in a way that there's, there's so much pent up demand right now Because of all the process transformation that is needed. And anyway, so net, net is that's, that's part of what, what we see like apropos and others have been had this very European flavor and very academic flavor, and that shows and how they come to market.\n\nSoren Frederiksen  21:18  \nMaybe because, maybe I just should show you, because I think it's easier than talking to it. But if you actually see our product compared to Apple, more, I mean, this is our dashboard, for instance, right where, and you have the process map that all process mining companies will talk about and show the flow and stuff. But this is more of a marketing tool that we like. Whenever we go do anything with a client. We don't really use it. We use the technology that is underneath to be able to build this right, right? So we can see how long does it take from like the different steps, from one step to another and so forth, right? And you can filter on things and but you never, actually, as a person, use this, and you never show this to a to a board member, unless it's to impress them, right? Because it's not as useful. What you find are all the insights that come out of that, right, all of the numbers that come out of it. And then. So we built this up. We're a no code platform that integrates, but integrates with Python to externally. So we can build all of this stuff with injecting data, and then do it on all with no code. So we're fairly different than Apple more but we're not as deep as they are in all the nooks and crannies of deep algorithms, because so far, we haven't seen it needed. Like 95% of all the customers we talked to are so basic that you don't need all the fancy stuff. Yeah, right.\n\nBill Karpovich  22:39  \nSo, okay, you're, you're definitely hitting on a lot of the points that we've come to collision. Like, yeah, these process maps, I mean, I mean, I've spent hours with them, and I'm like, I cannot get value out of this, but these five insights and reports useful, right?\n\nSoren Frederiksen  22:59  \nAnd the biggest thing is, and we so we've stopped almost selling directly to customers, and pretty much go through PwC, NCT and consulting houses, because 60 to 80% of your project is spent getting the data, sure, transforming it from some kind of ERP into the event log that we need, right? We build some AI also there, because it's gotten so good at looking at your database, and then it can now almost build the queries for you, right? So we build up these queries. And if cloud code can do this extremely well as well, right? You just need to connect to it. So, so if you're doing that's the biggest hurdle of process mining is getting a hold of the data, like being allowed to go to get the data and then actually transforming it, right, the analysis. So we just had a project in Germany where the project was three weeks, and it was two and a half weeks of data and then two days of analysis, right? It was like that order and then and they found, like, a bunch of million dollars for these train carts that were staying too long in this repair shop, and that was the whole outcome, right? There was two slides with four numbers and saying, yeah, do this, and then you will save all this money. And then the process map was irrelevant, right? We didn't even show it.\n\nBill Karpovich  24:13  \nSo, yeah, it's the ultimately, the outcome on the data side. So what systems are you typically interfacing with and and what have you learned in terms of, I know, is it data export and import, which is the path of least resistance? Is it staying inside of their DMZ somehow? Is it, you know, other techniques to really, somehow cut get through the data access challenges?\n\nSoren Frederiksen  24:38  \nYeah, it is. We've taken a couple of swings at this. And because we didn't, we started with customers like we started with Motorola, but we got in because of a friend, not because they had a demand. So it was kind of the wrong customer we were in with. So the customers we've learned from in the US, I thought that people had their data warehouse further along, right? So we thought we can just dip into the data warehouse and get the data. That's not the case, right? That's the rarity. You find somebody that has the data available in data warehouse. We tried to build our own, and we did partially do our own warehouse instead of because we were SOC, two certified. So if you go out and use another provider, now you have two different people in the contract, right? So it gets tricky to do that. So we tried to build our own. We did build our own, but it was too hard to maintain to keep our own data warehouse. So now what we do is we only go to source systems and we can connect to 20 but it has to have a database behind it. So if it has a query language, we can connect to it, and then we just ingest the data directly. And that means if you're going into something that has an API, we can't connect to it unless it's transferred into a database first. But we've kind of made that choice right now, because if you have a database, you extract out of I can just write five queries, run them nightly, and I can directly pull data out. So we kind of stopped salon is like, force you to use their data warehouse for instance, right? And they probably also make some money on it. I think it's a really bad choice in the long run, because a company shouldn't choose salon is for the data warehouse because of process mining, they should have their data warehouse and then choose a one or many process mining vendors out of there, right? So, so we so that's the approach we're taking right now. So SAP is a big one we pull out of, or Oracle we pull out of for hospitals, and there we just go directly to the database and get what we need. Yeah, so we just get a read connection and and that, the good thing about that is the cost for us, like running the queries is minimal, right? We don't have the warehousing of their data. We don't get all the privacy and we only pull out the columns we need. Like if you do in salon is you're going to synchronize now your data to their data warehouse, and now you have privacy concerns of having things you shouldn't have. And so so we're finding that has been a pretty good way of doing it, and companies seem to like it as well. And then we only pull out the event log. So that's kind of, that's the approach we're taking bill on. Yeah, interesting.\n\nBill Karpovich  27:06  \nListen, we are interested in, as you can tell, we're in the, in this formation stage, and, and, and, you know, this OEM possibilities is, is interesting for us, right? Because we're still in the Where do you buy Bill partner? You know, our our insight is, I think more is probably coming through on how do we think about getting it to market, right? So if there's, you know, a partnership, technology wise, that makes sense, and particularly if that partner is themselves, very AI centric, because that's a must in this world. And, you know, I think that, I think that is interesting for us. And sounds like you guys are, you know, kind of in the small stage and so, you know, open to creative discussions and that kind of thing. And, yeah, I'd be, I'd love to try and and get a little smarter on stuff and see if that might be a path. And it sounds like you're committed to, you know, you guys, your principal and your your thing, right? So you want to find that, have that thing, find a home before you would be thinking about something new personally, right? Yeah.\n\nSoren Frederiksen  28:19  \nI mean, I would consult, because we're talking right now. We're trying to bring in some cash to this and figure it all out. So be open to do consulting, but not jumping ship without I mean, really good with my partner. So but, and the other thing bill would be interesting too, is if you want to just be educated and some of your other team, if you have other team members, I'm happy to take, kind of an open up the hood and show us your stuff, because if you're you're probably going after North America, I'd imagine, right\n\nBill Karpovich  28:48  \nfor sure. Yeah, that's where\n\nSoren Frederiksen  28:51  \nwe're not really there. We're barely selling to the US. We're not really competing. So, and I find often it's, I like to open cards first, even though it's not the country like normal in us. And then because, you know, either we land that we can work together, or we don't, right, I don't want to sell you on a bunch of stuff that doesn't work. And then hopefully we have, we I'm super proud of what we built, and it's really cool all the stuff we have, right? So, but if it doesn't fit, there's nothing I can do to make you,\n\nBill Karpovich  29:18  \nyeah, exactly.\n\nSoren Frederiksen  29:20  \nSo I'd be happy if you want to learn some more and pick our brain and all of us stuff, I'm happy to share it sure how we do that transformation in our code and all that stuff.\n\nBill Karpovich  29:28  \nSo perfect. Yeah, I'd love, I'd love. That would be terrific for us as next step. And I've got a partner who's helping me on the thing through this, so I'd bring in and, and, then, yeah, we'd love to do it.\n\nSoren Frederiksen  29:42  \nOkay, yep. So yeah, we actually, we go so far. We change the colors of all of our stuff so you can brand it on your own. We, we did that early on, and we didn't really, we had one taker, but not really. And the consulting houses don't want to sell software. They want somebody else to take care of that, right? So we haven't really used it, but it's, it's all there for Omn, and you can host it on your own and set up your own servers and stuff. So great.\n\nBill Karpovich  30:07  \nAnd do you have a is there a multi tenant version of it? Bring it locally?\n\nSoren Frederiksen  30:12  \nSo I did 17 years of on premise casino software, and I said, I will never do on premise again. So all of it was built from ground up on SaaS. And then people came and said, but we're hospital. We don't want to go in cloud. So we, we actually re architected our stuff to run exactly the same code in cloud and on premise, but it's all multi tenant. Yeah, it's all multi tenant. And okay, good Active Directory and so forth. But, yeah,\n\nBill Karpovich  30:35  \nthat that problem is quite as big of a problem as it\n\nSoren Frederiksen  30:40  \nused to be. No, it's in deploying all. I mean, we do everything with.net it's all Microsoft.\n\nBill Karpovich  30:46  \nOh, it is okay, wow. But\n\nSoren Frederiksen  30:48  \nwe deploy on either, I mean, we've actually gotten credits from all of the vendors. So we started in Azure, then we went to Google, and now we're on Amazon, so we can kind of host anywhere. We ripped out any Azure services to make sure we were not relying on anybody. So we don't have any tie to any vendor. We're also, right now we're in Saudi Arabia, actually, so we are hosting on Alibaba, because there's like, you have to be in Saudi Arabia to be able to sell to Saudi Arabian companies.\n\nBill Karpovich  31:18  \nYeah, interesting. But your, but your, your software stack is is aligned to the Microsoft stuff.\n\nSoren Frederiksen  31:26  \nIt's all the latest.it called.net and we use a new technology called blazer, which is brand new web technology from Microsoft.\n\nBill Karpovich  31:33  \nYeah, yeah. Okay, interesting. Okay, good, yeah. So let's find a time to connect. How are you guys? H, I'm gonna be starting Wednesday of next week. I'm gonna be out of pocket, but I do have some time Monday, Tuesday, by any chance, if you guys had time, then,\n\nSoren Frederiksen  31:56  \nyeah, you want me to let like, join James, join in.\n\nBill Karpovich  32:00  \nOh yeah, your call. Let me just give me a tech talk.\n\nSoren Frederiksen  32:02  \nYeah, tech call, then it's probably just me, but he's Yeah, Monday after after 12 Eastern, okay,\n\nBill Karpovich  32:11  \nafter 12 Eastern, same, same.\n\nSoren Frederiksen  32:12  \nTuesday, both days after 12 afternoon, right?\n\nBill Karpovich  32:16  \nAll right, let me go check here with Dan. And, okay, good, yeah. And I look pretty good after 12 on Monday, Tuesday. Do you want\n\nSoren Frederiksen  32:27  \nto just do it like a like, kind of show you the platform and how we would normally do a deployment, and kind of take you through some of the stuff, because I don't want it to be necessarily a sales call, call on features, but maybe,\n\nBill Karpovich  32:38  \nno, I think isn't a product however, you typically go through your product briefing around, you know, capabilities, functions, and allow us to to learn more and get a sense of of, you know, it's you're gonna have a bunch of, you know, myself, yourself, and other guy, product guy, so we can just go Through it'll take, take, take its natural course. And yeah.\n\nSoren Frederiksen  33:03  \nHave you tried any process mining products before? Yeah, yeah, okay. Which ones have you tried? Just so I\n\nBill Karpovich  33:11  \nwas celonis for sure. And then a couple of other niches, tools, the summon in the Salesforce ecosystem. We played with those ones that come to\n\nSoren Frederiksen  33:26  \nmind. We don't have to say, what is process mining?\n\nBill Karpovich  33:33  \nYeah, but again, but whatever would be again, your way of briefing it even how you, how you interesting, how you position talk to customers, right? But, yeah, I think it'll, it'll take its natural course, if we just get on the phone and and walk through it. Okay. Okay, good, so I'll follow up then with and want to make sure, is it Soren? Is that how I pronounce your first name? Yep. Okay, perfect. All right, let me make sure. I've got\n\nSoren Frederiksen  34:07  \nmaybe one last question, Bill, you, were you going after hospitals? I like Ross mentioned that we,\n\nBill Karpovich  34:12  \nyeah, we do have healthcare is one of our, one of our verticals that we know well and that we see this problem, you know, where they you know, have intense pressures to do things, but just have no don't have the visibility and intelligence needed to make good decisions.\n\nSoren Frederiksen  34:33  \nAnd Salesforce customers,\n\nBill Karpovich  34:36  \nor, yeah, yeah. And so the ones we're talking to, typically, are our Salesforce customers. That's been the kind of a focusing principle for the current business. And so that's, that's kind of the this first pull of pain that we're that we're focused on, that we know very well.\n\nSoren Frederiksen  34:56  \nOkay, I'll just show some of the stuff, and because we do a lot of patient flow and hospitals is kind of our interesting part. But, yeah,\n\nBill Karpovich  35:02  \nthat'd be, that'd be really interesting to hear. And so you mentioned Oracle is kind of the system there. It'd be curious is, I mean, do you ever interface with Epic?\n\nSoren Frederiksen  35:13  \nWe were supposed to. It hasn't started yet. It's actually, it's same thing. It's actually in Saudi Arabia client, but we're, we're waiting for it, and we have some of the transformation done, but it's not gone live yet. Yeah, so, but it's, yeah, they, they're, she's an interesting woman, oh\n\nBill Karpovich  35:31  \nmy goodness, is she, huh? Yeah,\n\nSoren Frederiksen  35:33  \nthey did. And those, and those, and like the two, like them and Soren are the two kind of big players, right? And you got to do one or the other. And it's, yeah, it is. Hospitals are difficult. So we actually have Ottawa Hospital as well, and the cancer ward there that we're just coming on board now. But it's, it's taken six months just to get approvals, oh yeah, it just takes so long to go through it, right? So, and we have a hospital in Australia that's supposed to come online with Hitachi, actually, as well, because they just don't have the technology anymore, and they can't use Apple more anymore, right? They're kind of off the market, which was great for us, right? So, and the other only other players that are out there now is like IBM does on premise, but they're IBM, right? So they're like, you either love IBM, or you're like, told the other ballpark. So there aren't a lot of on premise anymore, which is really interesting space for\n\nBill Karpovich  36:27  \nus, huh? Yeah, it is interesting. Okay, well, good. Well, again, I'll firm up just a time on Monday or Tuesday. We'll pick up then and then, enjoyed getting acquainted here in a quick call. And hope you have a great weekend.\n\nSoren Frederiksen  36:39  \nYou too nice to meet you. Bill.\n\nTranscribed by https://otter.ai",
  "mediaFileName": null,
  "transcriptionFileName": null,
  "createdAt": "2025-12-02T00:40:33.212Z"
}